pome1 = '''起看山色拂雲開，萬壑千重紫翠來。開戶鄭真芳草遙，閉關許瑾落花誰。
           醉醒只向書倉坐，醒醉惟從夢境回。塵世簪纓從不問，浮雲難上釣魚台。
           問誰花里掩松關，有客新從塵市還。來去燕當簾際舞，去來鷗在水濱間。
           人言行己在皆濁，吾謂持身良獨艱。濁世市交多惡客，但令無得近雲山。
           自憐衣褐老隆中，憶自童年倏作翁。湖海氣消年亦謝，煙霞情重癖難攻。
           謝山雲臥輸陶令，蔣迳花香勝鄭公。將寄愁懷對明月，只將琴拂弄三終。'''

pome = "".join( [ i for i in pome1 if i not in (" " , "\n" , "。" , "，" ) ] )

m = 15

ss = [ 2 , 6 , 2 , 2 , 6 , 6 , 6 , 2 , 2 , 6 , 2] 

dr = [ 1 , 0 , -1 , 0 ]

ds = [ 0 , -1 , 0 , 1 ]

p = [ [ "  " ]*m for i in range(m) ]

r , s , d = 0 , m - 1 , 0

c , w = 0 , 0

for i in pome :

    p[r][s] = i

    if c == ss[ w%len(ss) ] :

        c = 0

        w = w + 1

        d = d + 1

    c = c + 1

    r = r + dr[d%4]

    s = s + ds[d%4]

for i in range (m) :

    print( "".join( p[i] ) ) 







